In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
lis = list('rahul')
arr = np.arange(5)

dictionary = dict(zip(arr, lis))
print(dictionary)

{0: 'r', 1: 'a', 2: 'h', 3: 'u', 4: 'l'}

In [4]:
series1 = pd.Series(lis)
series2 = pd.Series(arr)
series3 = pd.Series(dictionary)

print(series1)
print(series2)
print(series3)

0    r
1    a
2    h
3    u
4    l
dtype: object
0    0
1    1
2    2
3    3
4    4
dtype: int64
0    r
1    a
2    h
3    u
4    l
dtype: object

In [5]:
df = series3.reset_index()

In [6]:
print(df)

   index  0
0      0  r
1      1  a
2      2  h
3      3  u
4      4  l

In [7]:
df = df.reset_index()
print(df)

   level_0  index  0
0        0      0  r
1        1      1  a
2        2      2  h
3        3      3  u
4        4      4  l

In [8]:
df1 = pd.concat([series1, series2], axis = 1)
print(df1)

   0  1
0  r  0
1  a  1
2  h  2
3  u  3
4  l  4

In [9]:
df1.columns

RangeIndex(start=0, stop=2, step=1)

In [10]:
df1.columns = ['Col1', 'Col2']

In [11]:
print(df1)

  Col1  Col2
0    r     0
1    a     1
2    h     2
3    u     3
4    l     4

In [12]:
df2 = pd.DataFrame({'Col1' : series1, 'Col2' : series2})

In [13]:
print(df2)

  Col1  Col2
0    r     0
1    a     1
2    h     2
3    u     3
4    l     4

In [14]:
age_series = pd.Series([21, 23, 25, 27, 29])
name_series = pd.Series(['Girish', 'Cristiano', 'Messi', 'Neymar', 'Ramos'])
salary_series = pd.Series([125000, 123990, 230000, 233244, 1231232])
experience_series = pd.Series([1, 2, 3, 4, 5])

df3 = pd.DataFrame({'Age' : age_series, 'Name' : name_series, 'Salary' : salary_series, 'Experience' : experience_series})

In [15]:
print(df3)

   Age       Name   Salary  Experience
0   21     Girish   125000           1
1   23  Cristiano   123990           2
2   25      Messi   230000           3
3   27     Neymar   233244           4
4   29      Ramos  1231232           5

In [16]:
print(df2['Col1'])

0    r
1    a
2    h
3    u
4    l
Name: Col1, dtype: object

In [17]:
print(df2['Col2'])

0    0
1    1
2    2
3    3
4    4
Name: Col2, dtype: int64

In [18]:
print(df2['Col2'].min())

0

In [19]:
print(df2['Col2'].max())

4

In [20]:
print(df2['Col2'].mean())

2.0

In [21]:
print(df2['Col2'].std())

1.5811388300841898

In [22]:
print(df2['Col2'].median())

2.0

In [25]:
print(df.mean())

level_0    2.0
index      2.0
dtype: float64

In [26]:
print(df2['Col2'])

0    0
1    1
2    2
3    3
4    4
Name: Col2, dtype: int64

In [27]:
print(df2.Col2)

0    0
1    1
2    2
3    3
4    4
Name: Col2, dtype: int64

In [28]:
# age, designation, name, salary
age_series = pd.Series([21, 23, 25, 27, 29])
name_series = pd.Series(['Girish', 'Cristiano', 'Messi', 'Neymar', 'Ramos'])
salary_series = pd.Series([125000, 123990, 230000, 233244, 1231232])
designation_series = pd.Series(['Manager', 'Developer', 'Developer', 'CEO', 'Developer'])

df4 = pd.DataFrame({'age' : age_series, 'designation' : designation_series, 'name' : name_series, 'salary' : salary_series})

In [29]:
print(df4)

   age designation       name   salary
0   21     Manager     Girish   125000
1   23   Developer  Cristiano   123990
2   25   Developer      Messi   230000
3   27         CEO     Neymar   233244
4   29   Developer      Ramos  1231232

In [30]:
df4.set_index(['age'])

    designation       name   salary
age
21      Manager     Girish   125000
23    Developer  Cristiano   123990
25    Developer      Messi   230000
27          CEO     Neymar   233244
29    Developer      Ramos  1231232

In [31]:
df4.reset_index()

   index  age designation       name   salary
0      0   21     Manager     Girish   125000
1      1   23   Developer  Cristiano   123990
2      2   25   Developer      Messi   230000
3      3   27         CEO     Neymar   233244
4      4   29   Developer      Ramos  1231232

In [32]:
df5 = pd.DataFrame({'age' : age_series, 'designation' : designation_series, 'name' : name_series, 'salary' : salary_series})
print(df5)

   age designation       name   salary
0   21     Manager     Girish   125000
1   23   Developer  Cristiano   123990
2   25   Developer      Messi   230000
3   27         CEO     Neymar   233244
4   29   Developer      Ramos  1231232

In [39]:
df6 = df5.set_index(['age'])

In [34]:
print(df5['designation'])

0      Manager
1    Developer
2    Developer
3          CEO
4    Developer
Name: designation, dtype: object

In [37]:
print(df5[1:])

   age designation       name   salary
1   23   Developer  Cristiano   123990
2   25   Developer      Messi   230000
3   27         CEO     Neymar   233244
4   29   Developer      Ramos  1231232

In [38]:
print(df5.iloc[0])

age                 21
designation    Manager
name            Girish
salary          125000
Name: 0, dtype: object

In [40]:
print(df5.loc[4])

age                   29
designation    Developer
name               Ramos
salary           1231232
Name: 4, dtype: object

In [41]:
print(df6)

    designation       name   salary
age
21      Manager     Girish   125000
23    Developer  Cristiano   123990
25    Developer      Messi   230000
27          CEO     Neymar   233244
29    Developer      Ramos  1231232

In [45]:
print(df6.loc[23]) # Index Based

designation    Developer
name           Cristiano
salary            123990
Name: 23, dtype: object

In [46]:
print(df6.iloc[1]) # Row Number based

designation    Developer
name           Cristiano
salary            123990
Name: 23, dtype: object

In [47]:
print(df6.loc[29])

designation    Developer
name               Ramos
salary           1231232
Name: 29, dtype: object

In [48]:
print(df6[df6['name'] == 'Messi'])

    designation   name  salary
age
25    Developer  Messi  230000

In [49]:
print(df6[df6['name'] == 'Messi'].salary)

age
25    230000
Name: salary, dtype: int64

In [52]:
print(df6[df6['designation'] == 'Developer'].mean())

salary    528407.333333
dtype: float64

In [58]:
print(df6[df6['designation'] == 'Developer'].salary.std())

610967.604772408

In [59]:
print(df6.sort_values('salary', ascending = False))

    designation       name   salary
age
29    Developer      Ramos  1231232
27          CEO     Neymar   233244
25    Developer      Messi   230000
21      Manager     Girish   125000
23    Developer  Cristiano   123990

In [65]:
df6[(df6['designation'] == 'Manager') | (df6['designation'] == 'CEO')]

    designation    name  salary
age
21      Manager  Girish  125000
27          CEO  Neymar  233244

In [68]:
# Second Max Salary
print(df6.sort_values('salary', ascending = False).iloc[1].salary)

233244

In [69]:
df6.groupby('designation')

In [74]:
#Count number of null values
df6.isnull().sum()

designation    0
name           0
salary         0
dtype: int64

In [75]:
# Fill null values with mean
df6.fillna(df6['salary'].mean())

    designation       name   salary
age
21      Manager     Girish   125000
23    Developer  Cristiano   123990
25    Developer      Messi   230000
27          CEO     Neymar   233244
29    Developer      Ramos  1231232

In [76]:
# Delete column
#del df6['salary']

#drop(column, axis = 1)

In [77]:
# SQL 

# select * from table1;
# print(table1)

# select salary from table1;
# print(table1['salary'])

# select * from table1 where designation = 'CEO';
# print(table1[table1['designation' == 'CEO']])

# select max(salary) from table1 where designation = 'CEO'
# print(table1[table1['designation'] == 'CEO'].salary.max())

In [78]:
# TODO (Read)

# corr
# cov


# histogram
# boxplot
# pairplot
# barplot
# piechart
# scatterplot

# pdf
# cdf